---
kind: method
id: M:Autodesk.Revit.DB.ElementIdParameterValue.#ctor(Autodesk.Revit.DB.ElementId)
source: html/71be9b9e-56cf-c332-2fd0-7c1204640dd6.htm
---
# Autodesk.Revit.DB.ElementIdParameterValue.#ctor Method

Value constructor

## Syntax (C#)
```csharp
public ElementIdParameterValue(
	ElementId value
)
```

## Parameters
- **value** (`Autodesk.Revit.DB.ElementId`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null